### 1. Что выведет эта программа?

```
x = 3
y = 1
while x>0:
    y += x
    x -= 2
print(y)
```

```x=3>0```  , поэтому входим в цикл
  
```
y = 1+3 = 4
x = 3-2 = 1
1 > 0 
y = 4+1 = 5
x = 1-2 = -1
-1 < 0
```
только две итерации, в итоге  
### y=5

Проверим

In [1]:
x = 3
y = 1
while x>0:
  y += x
  x -= 2
print(y)

5

###2. Найти вторую самую большую зп из таблицы Employee

In [0]:
import pandas as pd
import numpy as np
import datetime
import re

In [3]:
d = {'emp_id':pd.Series([1, 2, 3, 4]), 'emp_name':pd.Series(['Петр', 'Иван', 'Алексей', 'Михаил']), \
     'dept_id':pd.Series(['10', '10', '11', '11']), 'salary':pd.Series([2000, 4000, 6000, 8000])}
Employee = pd.DataFrame(d)
Employee.head()

  dept_id  emp_id emp_name  salary
0      10       1     Петр    2000
1      10       2     Иван    4000
2      11       3  Алексей    6000
3      11       4   Михаил    8000

In [4]:
Employee.sort_values(by='salary', ascending=False)['salary'].iloc[1]

6000

###3. Найти самые большие ЗП в каждом отделе + название отдела из таблицы с подразделениями Employee, Depart

In [5]:
dd = {'Depart_id':pd.Series(['10', '11']), 'Depart_name':pd.Series(['Отдел снабжения', 'Отдел сбыта'])}
Depart = pd.DataFrame(dd)
Depart

  Depart_id      Depart_name
0        10  Отдел снабжения
1        11      Отдел сбыта

In [6]:
new_columns = Depart.columns.values
new_columns[0] = 'dept_id'
Depart.columns = new_columns
Depart

  dept_id      Depart_name
0      10  Отдел снабжения
1      11      Отдел сбыта

In [7]:
workers = pd.merge(Employee, Depart, on='dept_id')
workers

  dept_id  emp_id emp_name  salary      Depart_name
0      10       1     Петр    2000  Отдел снабжения
1      10       2     Иван    4000  Отдел снабжения
2      11       3  Алексей    6000      Отдел сбыта
3      11       4   Михаил    8000      Отдел сбыта

In [8]:
workers.groupby(by='Depart_name')['salary'].agg('max')

Depart_name
Отдел сбыта        8000
Отдел снабжения    4000
Name: salary, dtype: int64

### 4. Найти сотрудников с именем "Петр" вне зависимости от регистра ("ПЕТР", "петр" и т.п.) Employee

In [9]:
Employee[Employee['emp_name'].str.contains('петр', case=False)]

  dept_id  emp_id emp_name  salary
0      10       1     Петр    2000

In [10]:
Employee[Employee['emp_name'].str.contains('петр', regex=True, flags=re.IGNORECASE)]

  dept_id  emp_id emp_name  salary
0      10       1     Петр    2000

###5. Приход и расход денег в каждой точке происходит  1 раз в день. Написать запрос с выходными данными (пункт дата приход расход). Таблицы Income, Outcome

In [11]:
df_income = pd.read_excel('../content/task.xlsx', sheet_name='Таблицы', usecols='M:O', skiprows=1, nrows=10).iloc[:9]
#пришлось добавить iloc, потому что писал в google colab с pandas 0.22, где опция nrows еще не доступна
df_income.head()

   point                     date       In
0    1.0  2001-03-22 00:00:00.000  15000.0
1    1.0  2001-03-23 00:00:00.000  15000.0
2    1.0  2001-03-24 00:00:00.000   3400.0
3    1.0  2001-04-13 00:00:00.000   5000.0
4    1.0  2001-05-11 00:00:00.000   4500.0

In [12]:
df_outcome = pd.read_excel('../content/task.xlsx', sheet_name='Таблицы', usecols='Q:S', skiprows=1).iloc[:15]
df_outcome.head()

   point                     date      Out
0    1.0  2001-03-14 00:00:00.000  15348.0
1    1.0  2001-03-24 00:00:00.000   3663.0
2    1.0  2001-03-26 00:00:00.000   1221.0
3    1.0  2001-03-28 00:00:00.000   2075.0
4    1.0  2001-03-29 00:00:00.000   2004.0

In [13]:
result = pd.merge(df_income, df_outcome, how='outer', on=['point', 'date']).sort_values(by=['date', 'point'])
result

    point                     date       In       Out
9     1.0  2001-03-14 00:00:00.000      NaN  15348.00
0     1.0  2001-03-22 00:00:00.000  15000.0       NaN
5     2.0  2001-03-22 00:00:00.000  10000.0   1440.00
1     1.0  2001-03-23 00:00:00.000  15000.0       NaN
2     1.0  2001-03-24 00:00:00.000   3400.0   3663.00
6     2.0  2001-03-24 00:00:00.000   1500.0       NaN
10    1.0  2001-03-26 00:00:00.000      NaN   1221.00
11    1.0  2001-03-28 00:00:00.000      NaN   2075.00
12    1.0  2001-03-29 00:00:00.000      NaN   2004.00
15    2.0  2001-03-29 00:00:00.000      NaN   7848.00
16    2.0  2001-04-02 00:00:00.000      NaN   2040.00
13    1.0  2001-04-11 00:00:00.000      NaN   3195.04
3     1.0  2001-04-13 00:00:00.000   5000.0   4490.00
14    1.0  2001-04-27 00:00:00.000      NaN   3110.00
4     1.0  2001-05-11 00:00:00.000   4500.0   2530.00
7     3.0  2001-09-13 00:00:00.000  11500.0   1500.00
17    3.0  2001-09-14 00:00:00.000      NaN   2300.00
8     3.0  2001-10-02 00:00:00.000  18000.0       NaN
18    3.0  2002-09-16 00:00:00.000      NaN   2150.00

###6. Выбрать производителя, выпускающего компьютеры но не выпускающего принтеры

In [14]:
d3 = {'Firm':pd.Series(['A','A','A','A','A','B','D','D','E','E','E','E']), \
      'model':pd.Series(['3080','3083','3190','3503','3520','2803','3220','3583','3150','3585','5280','5283']), \
      'type':pd.Series(['PC','PC','Printer','Printer','Printer','PC','Printer','Printer','PC','Printer','PC','PC'])}
Product = pd.DataFrame(d3)
Product

   Firm model     type
0     A  3080       PC
1     A  3083       PC
2     A  3190  Printer
3     A  3503  Printer
4     A  3520  Printer
5     B  2803       PC
6     D  3220  Printer
7     D  3583  Printer
8     E  3150       PC
9     E  3585  Printer
10    E  5280       PC
11    E  5283       PC

In [15]:
#grouped = Product.groupby('Firm')['type'].value_counts()
grouped = Product.pivot_table(index='Firm', columns='type', aggfunc='count')
grouped

     model
type    PC Printer
Firm
A      2.0     3.0
B      1.0     NaN
D      NaN     2.0
E      3.0     1.0

In [16]:
grouped[grouped['model']['Printer'].isnull()]

     model
type    PC Printer
Firm
B      1.0     NaN

###7. Определить глубину проникновения по продуктам: рублевые и валютные счета каждому ГОСБ на последнюю дату Таблица - COOPERATION

In [19]:
cooperation = pd.read_excel('../content/task.xlsx', sheet_name='Таблицы', usecols='AE:AI', skiprows=1).iloc[:203]
cooperation.tail()

                        GOSB     ID_ORG  VAL_ACCA  RUB_ACCA  DATE_LOAD
198  Республика Башкортостан  1-2QWQ2Y1       NaN       NaN 2015-09-30
199  Республика Башкортостан  1-3E0R7T4       NaN       NaN 2015-09-30
200     Свердловская область  1-5JOY756       NaN       NaN 2015-09-30
201  Республика Башкортостан   1-8ERQS4       NaN       NaN 2015-09-30
202  Республика Башкортостан  1-5Q6WMP0       NaN       NaN 2015-09-30

In [20]:
len(cooperation['ID_ORG'].unique())

203

In [21]:
cooperation['GOSB'].unique()

array(['Челябинская область', 'Республика Башкортостан',
       'Свердловская область'], dtype=object)

In [22]:
cooperation.groupby(by=['GOSB'])['VAL_ACCA', 'RUB_ACCA'].agg('count').head()

                         VAL_ACCA  RUB_ACCA
GOSB
Республика Башкортостан         8         9
Свердловская область           14        24
Челябинская область            12        31

### 8. Какое количество уникальных точек (поле INK) находились в 5 зоне (поле TIMEZONE) в сентябре?

In [23]:
tab2 = pd.read_excel('../content/task.xlsx', sheet_name='Таблицы', usecols='U:AC', skiprows=1).iloc[:18913]
tab2.tail()

,TB,GOSB,KIC,INK,TIMEZONE,CUT_TB,TYPE,VALUE,REPDATE
18908,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,8592,"ОО №8592/629 КИЦ ""Старооскольский""",842659333700001,2.0,ЦЧБ,OPERCOUNT,1,01.07.18
18909,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,8592,"ОО №8592/068 КИЦ ""Белгородский""",8592282897320477600002,1.0,ЦЧБ,OPERCOUNT,1,01.07.18
18910,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,9013,"ОО №9013/0199 КИЦ ""Воронежский""",9013537842219144200010,2.0,ЦЧБ,OPERCOUNT,15,01.07.18
18911,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,8592,"ОО №8592/237 КИЦ ""Валуйский""",9054537842219144200009,2.0,ЦЧБ,OPERCOUNT,14,01.07.18
18912,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,9013,"ОО №9013/443 КИЦ ""Борисоглебский""",9013537842219144200003,3.0,ЦЧБ,OPERCOUNT,6,01.07.18

In [24]:
tab2['REPDATE'] = pd.to_datetime(tab2['REPDATE'], format='%d.%m.%y')
tab2.head()

,TB,GOSB,KIC,INK,TIMEZONE,CUT_TB,TYPE,VALUE,REPDATE
0,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,8592,"ОО №8592/068 КИЦ ""Белгородский""",8592555276917671100004,1.0,ЦЧБ,OPERCOUNT,23,2018-08-01
1,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,9013,"ОО №9013/0199 КИЦ ""Воронежский""",9013484120855371100046,2.0,ЦЧБ,OPERCOUNT,26,2018-08-01
2,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,8594,"ОО №8594/0135 КИЦ ""Тамбовский""",8594286168702672900127,1.0,ЦЧБ,OPERCOUNT,30,2018-08-01
3,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,8594,"ОО №8594/0135 КИЦ ""Тамбовский""",8594286168702672900128,2.0,ЦЧБ,OPERCOUNT,30,2018-08-01
4,ЦЕНТРАЛЬНО-ЧЕРНОЗЕМНЫЙ БАНК ПАО СБЕРБАНК Г.ВОР...,8594,"ОО №8594/0135 КИЦ ""Тамбовский""",8594286168702672900130,1.0,ЦЧБ,OPERCOUNT,9,2018-08-01

In [25]:
len(tab2[np.logical_and(tab2['TIMEZONE']==5, tab2['REPDATE'].dt.month==9)]['INK'].unique())

821

### 9. Найдите сумму всех чисел, которые могут быть записаны в виде суммы пятых степеней их цифр.

Максимум, который даст нам одна цифра при сложении - это $9^5 = 59\,049$  
Для числа $999\,999$ сумма пятых степеней цифр равна $354\,294$, и если мы добавим еще одну девятку, то сумма всё равно останется 6-ти значной, т.о. можем ограничить наш поиск числом $9^5*6$

In [0]:
def sum_5(x):
  """ 
  Вычисляет сумму пятых степений числа х
  """
  result = 0
  for i in str(x):
    result += int(i)**5
  return result

In [27]:
result = 0
for num in range(2, 9**5*6):
  if num == sum_5(num):
    print(num)
    result += num
print(f'сумма искомых чисел равна {result}')

4150
4151
54748
92727
93084
194979
сумма искомых чисел равна 443839

### 10. Какова сумма чисел в диагоналях аналогичной спирали 1001 на 1001?
```
43 44 45 46 47 48 49
42 21 22 23 24 25 26
41 20  7  8  9 10 27
40 19  6  1  2 11 28
39 18  5  4  3 12 29
38 17 16 15 14 13 30
37 36 35 34 33 32 31
```

Сумма имеет следующий вид:
$1 + (3 + 5 + 7 + 9 )+ (13 + 17 + 21 + 25) + (31 + 37 + 43 + 49) + ...$
т.е. после 1,  каждое число (стоящее в углах первого квадрата 3х3) увеличивается на 2, затем следующие 4 угла прирастают на 4, затем на 6, на 8 и т.д.

In [0]:
def sum_diag(x):
  """
  Определяет сумму чисел, стоящих в диагоналях 'спирального' квадрата чисел
  размером х на х, x > 1, x - нечётное
  """
  sum = 1
  add = 1
  growth = 2
  for i in range(1, x, 2):
    for j in range(4):
      add += growth
      sum += add
    growth += 2
  return sum

In [29]:
print(sum_diag(5))

101

In [30]:
print(sum_diag(1001))

669171001

### 11. На вход подается две даты, найти следующий рабочий день от первой даты + разницу (в рабочих днях). Для расчетов пользоваться производственным календарем за 2016- 2017 год.

In [0]:
import requests

In [32]:
url = 'http://basicdata.ru/api/json/calend/'
prod_cal = requests.get(url).json()
prod_cal_dic = prod_cal['data']
print(prod_cal_dic['2017'])

{'1': {'2': {'isWorking': 2}, '3': {'isWorking': 2}, '4': {'isWorking': 2}, '5': {'isWorking': 2}, '6': {'isWorking': 2}}, '2': {'22': {'isWorking': 3}, '23': {'isWorking': 2}, '24': {'isWorking': 2}}, '3': {'7': {'isWorking': 3}, '8': {'isWorking': 2}}, '5': {'1': {'isWorking': 2}, '8': {'isWorking': 2}, '9': {'isWorking': 2}}, '6': {'12': {'isWorking': 2}}, '11': {'3': {'isWorking': 3}, '6': {'isWorking': 2}}}

В данном словаре дни помечены следующим образом:
* 0 — рабочий день;
* 2 — праздничный/нерабочий день;
* 3 — сокращенный на 1 час рабочий день.  

Все остальные, не указанные в словаре дни, соответствуют правилу по умолчанию: Пн-Пт = рабочий, Сб-Вс = выходной.

In [0]:
def check_prod_cal(date: datetime.date):
  """
  Возвращает 1, если date - это рабочий день, и 0 если выходной
  """
  try:
    x =  prod_cal_dic[str(date.year)][str(date.month)][str(date.day)]['isWorking']
    if x == 0:
      return 1
    elif x == 2:
      return 0
    elif x == 3:
      return 1
  except: 
    # считаем, что пользователи не будут вбивать несуществующие даты
    # т.е. исключение - это случай, когда даты нет в нашем словаре 
    if 0 <= date.weekday()<= 4:
      return 1
    else:
      return 0

In [35]:
d = datetime.date(2017, 5, 9)
print(check_prod_cal(d))

0

In [0]:
def find_work_days(date1: datetime.date, date2: datetime.date):
  """
  Возвращает два значения: 
    (date1 + 1 раб.день, разница в раб.днях между date1 и date2 включительно)
  """
  z = 0
  first_res = date1
  while z == 0:
    first_res =  first_res + datetime.timedelta(days=1) #прибавляем 1 раб.день
    z = check_prod_cal(first_res) #если выходной, тогда z = 0 и цикл повторится
  
  sec_res = check_prod_cal(date1)
  while date1 < date2:
    date1 = date1 + datetime.timedelta(days=1)
    sec_res += check_prod_cal(date1)
  return (first_res, sec_res)

In [37]:
d1 = datetime.date(2017, 5, 8)
d2 = datetime.date(2017, 5, 16)
print(find_work_days(d1, d2))

(datetime.date(2017, 5, 10), 5)

### 12. В таблицу 3 необходимо добавить в таблицу два новых поля:
PERCENTILE – перцентиль (квантиль) группы по значениям VALUES по порогу группы THRESHOLD.

Обозначения: GROUP_ID – ID группы.
ELEMENT – ID элемента.
VALUES – значение показателя элемента.
THRESHOLD – пороговое значение для группы.
DEVIATION – булево значение - 1 если значение (VALUES) элемента > порогового значения (PERCENTILE), иначе – 0.

In [44]:
np.random.seed(123)
tab3 = pd.DataFrame({'GROUP_ID': np.random.randint(1, 7, size=100),\
                     'ELEMENT': np.arange(1, 101),
                     'VALUES': np.random.randint(0, 50, size=100)\
                    })
tab3['THRESHOLD'] = tab3['GROUP_ID']*5
tab3 = tab3[['GROUP_ID','ELEMENT','VALUES','THRESHOLD']]
tab3.sort_values(by='GROUP_ID', inplace=True)
tab3.tail()

    GROUP_ID  ELEMENT  VALUES  THRESHOLD
51         6       52      13         30
68         6       69       1         30
56         6       57      30         30
89         6       90       9         30
0          6        1       6         30

In [48]:
tab3.groupby('GROUP_ID')['VALUES'].quantile(0.3)

GROUP_ID
1    16.9
2    13.3
3    12.0
4    12.6
5    13.5
6     9.0
Name: VALUES, dtype: float64

In [50]:
tab3.groupby('GROUP_ID')['VALUES'].quantile(tab3['THRESHOLD'][1])

ValueError: ignored